Public Transit Database
ETL, Excel, CSV, SQL
Task: Build an ETL pipeline to read data from two different source files into a reporting database that can be used to analyze trends in public transit usage across a couple major cities.

The datasets are as follows:
NYC Subway Monthly Ridership: Beginning 2008
Chicago CTA - Daily Boarding Totals

The data should be loaded into a postgres database with the following names and attributes:
monthly_totals
month: month of reporting period
city: city of reporting data
transportation_type: either bus or metro
ridership_count: total number of riders for the month

Once you have the monthly_totals table in postgres, write the necessary SQL statements to create two new tables, bus_monthly_totals and metro_monthly_totals, where each table contains only bus or metro rides.

What will the application do?
Extract data from three various datasets, apply the necessary transformations, and load into a database

In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

Read the Chicago CTA - Daily Boarding Totals dataset

In [2]:
filepath = 'CTA_-_Ridership_-_Daily_Boarding_Totals.csv'
chicago_CTA_df =pd.read_csv(filepath)

Perform necessary transformations/EDA on the NYC Subway Monthly Ridership dataset:

In [3]:
chicago_CTA_df.head(4)

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032

In [4]:
chicago_CTA_df.tail(4)

     service_date day_type     bus  rail_boardings  total_rides
8183   03/28/2023        W  521594          365749       887343
8184   03/29/2023        W  470430          353192       823622
8185   03/30/2023        W  517477          388264       905741
8186   03/31/2023        W  467904          309609       777513

In [5]:
chicago_CTA_df.shape

(8187, 5)

In [6]:
chicago_CTA_df.describe()

                bus  rail_boardings   total_rides
count  8.187000e+03    8.187000e+03  8.187000e+03
mean   7.308760e+05    5.257962e+05  1.256672e+06
std    2.701822e+05    2.093271e+05  4.653467e+05
min    8.078300e+04    2.354400e+04  1.100470e+05
25%    4.707930e+05    3.326815e+05  8.134855e+05
50%    8.128060e+05    5.993780e+05  1.499277e+06
75%    9.690830e+05    7.035940e+05  1.641632e+06
max    1.211992e+06    1.146516e+06  2.049519e+06

In [7]:
chicago_CTA_df.isnull()

      service_date  day_type    bus  rail_boardings  total_rides
0            False     False  False           False        False
1            False     False  False           False        False
2            False     False  False           False        False
3            False     False  False           False        False
4            False     False  False           False        False
...            ...       ...    ...             ...          ...
8182         False     False  False           False        False
8183         False     False  False           False        False
8184         False     False  False           False        False
8185         False     False  False           False        False
8186         False     False  False           False        False

[8187 rows x 5 columns]

In [8]:
chicago_CTA_df.dtypes

service_date      object
day_type          object
bus                int64
rail_boardings     int64
total_rides        int64
dtype: object

In [9]:
chicago_CTA_df.duplicated

<bound method DataFrame.duplicated of      service_date day_type     bus  rail_boardings  total_rides
0      01/01/2001        U  297192          126455       423647
1      01/02/2001        W  780827          501952      1282779
2      01/03/2001        W  824923          536432      1361355
3      01/04/2001        W  870021          550011      1420032
4      01/05/2001        W  890426          557917      1448343
...           ...      ...     ...             ...          ...
8182   03/27/2023        W  493436          320115       813551
8183   03/28/2023        W  521594          365749       887343
8184   03/29/2023        W  470430          353192       823622
8185   03/30/2023        W  517477          388264       905741
8186   03/31/2023        W  467904          309609       777513

[8187 rows x 5 columns]>

Dataframe to matvh table schema

In [10]:
# Rename columns to match the desired table schema
chicago_CTA_df = chicago_CTA_df.rename(columns={'service_date': 'month', 'total_rides': 'ridership_count'})

# Add additional columns
chicago_CTA_df['city'] = 'Chicago'
chicago_CTA_df['transportation_type'] = 'bus'

# Convert the 'month' column to a proper date format
chicago_CTA_df['month'] = pd.to_datetime(chicago_CTA_df['month'], format='%m/%d/%Y')

# Group by month
chicago_CTA_grouped = chicago_CTA_df.groupby('month').sum().reset_index()

# Add the missing columns to chicago_CTA_grouped
chicago_CTA_grouped['city'] = 'Chicago'
chicago_CTA_grouped['transportation_type'] = 'bus'
# Define an empty DataFrame for monthly_totals_df
monthly_totals_df = pd.DataFrame()
# Concatenate chicago_CTA_grouped with monthly_totals_df
monthly_totals_df = pd.concat([monthly_totals_df, chicago_CTA_grouped[['month', 'city', 'transportation_type', 'ridership_count']]], ignore_index=True)

C:\Users\paperspace\AppData\Local\Temp\1\ipykernel_11336\4147039595.py:12: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  chicago_CTA_grouped = chicago_CTA_df.groupby('month').sum().reset_index()

In [11]:
monthly_totals_df

          month     city transportation_type  ridership_count
0    2001-01-01  Chicago                 bus           423647
1    2001-01-02  Chicago                 bus          1282779
2    2001-01-03  Chicago                 bus          1361355
3    2001-01-04  Chicago                 bus          1420032
4    2001-01-05  Chicago                 bus          1448343
...         ...      ...                 ...              ...
8120 2023-03-27  Chicago                 bus           813551
8121 2023-03-28  Chicago                 bus           887343
8122 2023-03-29  Chicago                 bus           823622
8123 2023-03-30  Chicago                 bus           905741
8124 2023-03-31  Chicago                 bus           777513

[8125 rows x 4 columns]

Read NYC Subway Monthly Ridership: Beginning 2008 dataset

In [12]:
nyc_subway_df = pd.read_csv('C:\\Users\\paperspace\\Downloads\\ETLData\\Metropolitan_mothly_Ridership__Beginning_2008.csv')

Perform necessary transformations/EDA on the NYC Subway Monthly Ridership dataset:

In [13]:
nyc_subway_df.head(4)

             Agency Name   Indicator Name   Period  Monthly Actual
0  Long Island Rail Road  Total Ridership  2019-06      7736345.00
1  Long Island Rail Road  Total Ridership  2019-05      7974945.46
2  Long Island Rail Road  Total Ridership  2019-04      7724037.60
3  Long Island Rail Road  Total Ridership  2019-03      7515113.20

In [14]:
nyc_subway_df.tail(4)

     Agency Name             Indicator Name   Period  Monthly Actual
652  NYC Transit  Total Ridership - Subways  2008-04     136528969.0
653  NYC Transit  Total Ridership - Subways  2008-03     137148128.0
654  NYC Transit  Total Ridership - Subways  2008-02     125878662.0
655  NYC Transit  Total Ridership - Subways  2008-01     130687792.0

In [15]:
nyc_subway_df.shape

(656, 4)

In [16]:
nyc_subway_df.describe()

       Monthly Actual
count    6.560000e+02
mean     4.140184e+07
std      5.037421e+07
min      5.607406e+06
25%      7.202903e+06
50%      9.996154e+06
75%      5.767300e+07
max      1.611240e+08

In [17]:
nyc_subway_df.dtypes

Agency Name        object
Indicator Name     object
Period             object
Monthly Actual    float64
dtype: object

In [18]:
nyc_subway_df.isnull()

     Agency Name  Indicator Name  Period  Monthly Actual
0          False           False   False           False
1          False           False   False           False
2          False           False   False           False
3          False           False   False           False
4          False           False   False           False
..           ...             ...     ...             ...
651        False           False   False           False
652        False           False   False           False
653        False           False   False           False
654        False           False   False           False
655        False           False   False           False

[656 rows x 4 columns]

In [19]:
nyc_subway_df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
651    False
652    False
653    False
654    False
655    False
Length: 656, dtype: bool

In [20]:
# Rename columns to match the desired table schema
nyc_subway_df = nyc_subway_df.rename(columns={'Period': 'month', 'Monthly Actual': 'ridership_count'})

# Add additional columns
nyc_subway_df['city'] = 'New York'
nyc_subway_df['transportation_type'] = 'metro'

# Convert the 'month' column to a proper date format
nyc_subway_df['month'] = pd.to_datetime(nyc_subway_df['month'], format='%Y-%m')

# Select only the required columns for the monthly_totals table
monthly_totals_df = pd.concat([monthly_totals_df, nyc_subway_df[['month', 'city', 'transportation_type', 'ridership_count']]], ignore_index=True)

In [21]:
monthly_totals_df

          month      city transportation_type  ridership_count
0    2001-01-01   Chicago                 bus         423647.0
1    2001-01-02   Chicago                 bus        1282779.0
2    2001-01-03   Chicago                 bus        1361355.0
3    2001-01-04   Chicago                 bus        1420032.0
4    2001-01-05   Chicago                 bus        1448343.0
...         ...       ...                 ...              ...
8776 2008-05-01  New York               metro      140151863.0
8777 2008-04-01  New York               metro      136528969.0
8778 2008-03-01  New York               metro      137148128.0
8779 2008-02-01  New York               metro      125878662.0
8780 2008-01-01  New York               metro      130687792.0

[8781 rows x 4 columns]

In [22]:
monthly_totals_df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
8776    False
8777    False
8778    False
8779    False
8780    False
Length: 8781, dtype: bool

In [ ]:
import psycopg2

# Establish a connection to the PostgreSQL database
conn = psycopg2.connect(host='localhost', port='5432', database='postgres', user='postgres', password='welcome123')

# Create a cursor object
cur = conn.cursor()

# Create the monthly_totals table
cur.execute('''
    CREATE TABLE monthly_totals (
        month DATE,
        city VARCHAR(255),
        transportation_type VARCHAR(255),
        ridership_count INTEGER
    )
''')
# Insert data into the monthly_totals table
for _, row in monthly_totals_df.iterrows():
    cur.execute('''
        INSERT INTO monthly_totals (month, city, transportation_type, ridership_count)
        VALUES (%s, %s, %s, %s)
    ''', (row['month'], row['city'], row['transportation_type'], row['ridership_count']))


# Commit the changes
conn.commit()

# Close the cursor and the connection
cur.close()
conn.close()

Load data (monthly+total_df) into postgress database

In [24]:
# Replace 'your_username', 'your_password', 'your_host', and 'your_database' with the appropriate values
engine = create_engine('postgresql://postgres:welcome123@5432:5432/postgres')

In [27]:
import psycopg2

# Establish a connection to the PostgreSQL database
conn = psycopg2.connect(host='localhost', port='5432', database='postgres', user='postgres', password='welcome123')

# Create a cursor object
cur = conn.cursor()

# Create the monthly_totals table
cur.execute('''
    CREATE TABLE monthly_totals (
        month DATE,
        city VARCHAR(255),
        transportation_type VARCHAR(255),
        ridership_count INTEGER
    )
''')

# Commit the changes
conn.commit()

# Close the cursor and the connection
cur.close()
conn.close()

Load data into monthly table from monthly Data frame

In [30]:
import psycopg2
from sqlalchemy import create_engine

# Assuming you already have the DataFrame 'df' containing the data

# Establish a connection to the PostgreSQL database
conn = psycopg2.connect(host='localhost', port='5432', database='postgres', user='postgres', password='welcome123')

# Create a SQLAlchemy engine
engine = create_engine('postgresql+psycopg2://postgres:welcome123@localhost:5432/postgres')

# Convert the DataFrame to a temporary table in the database
monthly_totals_df.to_sql('temp_table', engine, if_exists='replace', index=False)

# Execute an INSERT INTO statement to insert data from the temporary table into the monthly_totals table
with conn.cursor() as cur:
    cur.execute('INSERT INTO monthly_totals (month, city, transportation_type, ridership_count) SELECT * FROM temp_table')
    conn.commit()

# Drop the temporary table
with conn.cursor() as cur:
    cur.execute('DROP TABLE IF EXISTS temp_table')
    conn.commit()

# Close the connection
conn.close()

In [ ]:

# Establish a connection to the PostgreSQL database
conn = psycopg2.connect(host='your_host', port='your_port', database='your_database', user='your_user', password='your_password')

# Create a cursor object
cur = conn.cursor()
# Create the bus_monthly_totals table
cur.execute('''
    CREATE TABLE bus_monthly_totals AS
    SELECT *
    FROM monthly_totals
    WHERE transportation_type = 'bus'
''')

# Create the metro_monthly_totals table
cur.execute('''
    CREATE TABLE metro_monthly_totals AS
    SELECT *
    FROM monthly_totals
    WHERE transportation_type = 'metro'
''')

# Commit the changes
conn.commit()

# Close the cursor and the connection
cur.close()
conn.close()